get_browsing_history.yml
---
execution:
- scenario : get
  concurrency: 100
  ramp-up: 5s
  hold-for: 30s

scenarios:
  get:
    data-sources:
    - access_token.csv 
    requests:
    - url: https://amitrajbaral-api-jp.mini.dev5s.com/browse_item_history/history?_app_version=9999&_platform=ios&_access_token=${ACCESS_TOKEN}
      label: browse_item_history
reporting:
- module: blazemeter